nicholasshort/Tempting/TemptingFirmware/STM32_WPAN/App/app_zigbee.c
  /* Wait completion of cmd */
  Wait_Getting_Ack_From_M0();
}

/**
 * @brief  This function is used to transfer the commands from the M4 to the M0 with notification
 *
 * @param   None
 * @return  None
 */
void ZIGBEE_CmdTransferWithNotif(void)
{
        g_ot_notification_allowed = 1;
        ZIGBEE_CmdTransfer();
}

/**
 * @brief  This function is called when the M0+ acknowledge the fact that it has received a Cmd
 *
 *
 * @param   Otbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_ZIGBEE_CmdEvtReceived(TL_EvtPacket_t *Otbuffer)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Otbuffer);

  Receive_Ack_From_M0();
}

/**
 * @brief  This function is called when notification from M0+ is received.
 *
 * @param   Notbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_ZIGBEE_NotReceived(TL_EvtPacket_t *Notbuffer)
{
  p_ZIGBEE_notif_M0_to_M4 = Notbuffer;

  Receive_Notification_From_M0();
}

/**
 * @brief  This function is called before sending any ot command to the M0
 *         core. The purpose of this function is to be able to check if
 *         there are no notifications coming from the M0 core which are
 *         pending before sending a new ot command.
 * @param  None
 * @retval None
 */
void Pre_ZigbeeCmdProcessing(void)
{
  UTIL_SEQ_WaitEvt(EVENT_SYNCHRO_BYPASS_IDLE);
}

/**
 * @brief  This function waits for getting an acknowledgment from the M0.
 *
 * @param  None
 * @retval None
 */
static void Wait_Getting_Ack_From_M0(void)
{
  UTIL_SEQ_WaitEvt(EVENT_ACK_FROM_M0_EVT);
}

/**
 * @brief  Receive an acknowledgment from the M0+ core.
 *         Each command send by the M4 to the M0 are acknowledged.
 *         This function is called under interrupt.
 * @param  None
 * @retval None
 */
static void Receive_Ack_From_M0(void)
{
  UTIL_SEQ_SetEvt(EVENT_ACK_FROM_M0_EVT);
}

/**
 * @brief  Receive a notification from the M0+ through the IPCC.
 *         This function is called under interrupt.
 * @param  None
 * @retval None
 */
static void Receive_Notification_From_M0(void)
{
  CptReceiveNotifyFromM0++;
  UTIL_SEQ_SetTask(1U << (uint32_t)CFG_TASK_NOTIFY_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
}

/**
 * @brief  This function is called when a request from M0+ is received.
 *
 * @param   Notbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_ZIGBEE_M0RequestReceived(TL_EvtPacket_t *Reqbuffer)
{
  p_ZIGBEE_request_M0_to_M4 = Reqbuffer;

  CptReceiveRequestFromM0++;
  UTIL_SEQ_SetTask(1U << (uint32_t)CFG_TASK_REQUEST_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
}

/**
 * @brief Perform initialization of TL for Zigbee.
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_TL_INIT(void)
{
  ZigbeeConfigBuffer.p_ZigbeeOtCmdRspBuffer = (uint8_t *)&ZigbeeOtCmdBuffer;
  ZigbeeConfigBuffer.p_ZigbeeNotAckBuffer = (uint8_t *)ZigbeeNotifRspEvtBuffer;
  ZigbeeConfigBuffer.p_ZigbeeNotifRequestBuffer = (uint8_t *)ZigbeeNotifRequestBuffer;
  TL_ZIGBEE_Init(&ZigbeeConfigBuffer);
}

/**
 * @brief Process the messages coming from the M0.
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ProcessNotifyM0ToM4(void)
{
  if (CptReceiveNotifyFromM0 != 0)
  {
    /* Reset counter */
    CptReceiveNotifyFromM0 = 0;
    Zigbee_CallBackProcessing();
  }
}

/**
 * @brief Process the requests coming from the M0.
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ProcessRequestM0ToM4(void)
{
  if (CptReceiveRequestFromM0 != 0)
  {
    CptReceiveRequestFromM0 = 0;
    Zigbee_M0RequestProcessing();
  }
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */


/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_App_Init(void)
{

  /* Timer creation */
  HW_TS_Create(CFG_TIM_ZIGBEE_APP_UPDATE_SENSOR_DATA_REPEAT, &TS_ID1, hw_ts_Repeated, APP_ZIGBEE_Update_Sensor_Data);

  APP_ZIGBEE_Sensor_Server_Init();
}

/**
 * @brief  On Off client initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_Sensor_Server_Init(void)
{
  /* Start the timer */
  HW_TS_Start(TS_ID1, (HW_TS_SERVER_30S_NB_TICKS));
}


static void APP_ZIGBEE_Update_Sensor_Data(void)
{
    float temp = 0.0f, press = 0.0f;
    uint16_t co2_ppm;

    // Get sensor data
    DPS368_GetPressure(&press);
    SCD41_SetAmbientPressure((int32_t)press);
    DPS368_GetTemperature(&temp);
    SCD41_ReadMeasurement(&co2_ppm, NULL, NULL);

    int16_t temp_attr_val = (int16_t)(temp * 100);      // Temperature in 0.01 °C resolution
    int16_t press_attr_val = (int16_t)(press / 10);     // Pressure in deciPascal
    float co2_attr_val = co2_ppm / 1e6f;            // Normalize to 0.0 - 1.0 range

    enum ZclStatusCodeT status;

    APP_DBG("Updating sensor data: %dC, %dhPa, %dppm", temp_attr_val, press_attr_val, co2_ppm);

    // Update temperature attribute
    status = ZbZclAttrIntegerWrite(zigbee_app_info.temperature_meas_server_1,
                                   ZCL_TEMP_MEAS_ATTR_MEAS_VAL,
                                   temp_attr_val);
    if (status != ZCL_STATUS_SUCCESS) {
        APP_DBG("Failed to update temperature attribute");
    }

    // Update pressure attribute
    status = ZbZclAttrIntegerWrite(zigbee_app_info.pressure_meas_server_1,
                                   ZCL_PRESS_MEAS_ATTR_MEAS_VAL,
                                   press_attr_val);
    if (status != ZCL_STATUS_SUCCESS) {
        APP_DBG("Failed to update pressure attribute");
    }


    /* Update CO2 attribute (custom cluster using float) */
    uint8_t co2_buf[32];  // enough for a 32-bit IEEE float
    float num = 0.5f;
    int len = ZbZclAppendFloat(num, ZCL_DATATYPE_FLOATING_SINGLE, co2_buf, sizeof(co2_buf));
    if (len <= 0) {
        APP_DBG("Failed to encode CO2 float value");
    } else {
        status = ZbZclAttrWrite(zigbee_app_info.co2_meas_server_1,
                                NULL, // local write
                                ZCL_CO2_MEAS_ATTR_MEAS_VAL,
                                co2_buf,
                                len,
								ZCL_ATTR_WRITE_FLAG_FORCE);
        if (status != ZCL_STATUS_SUCCESS) {
            APP_DBG("Failed to update CO2 attribute");
        }

        // Read back new CO2 value from attribute





    }



}


/* USER CODE END FD_LOCAL_FUNCTIONS */
